OpenFOAM-13/tutorials/multiRegion/CHT/shellAndTubeHeatExchanger/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc residuals(region = shell, p_rgh, U, h)
#includeFunc residuals(region = tube, p_rgh, U, h)
#includeFunc residuals(region = solid, e)

// ************************************************************************* //
